MOOC/app/views/lectures/_form.html.erb

SELECT `courses`.* FROM `courses`
---
    <%= form.label :course_id %><br>
    <%= form.collection_select :course_id, Course.all, :id, :title %>