MOOC/app/views/lectures/show.html.erb

    <div class="container">
        <h2 class="subtitle is-5"><strong><%= @lecture.comments.count %></strong> Comments</h2>
---
SELECT COUNT(*) FROM `comments` WHERE `comments`.`lecture_id` = 3