MOOC/app/views/courses/show.html.erb

SELECT `lectures`.* FROM `lectures` WHERE `lectures`.`course_id` = 1
---
  <strong>Lectures:</strong>
    <% @course.lectures.each do |lecture| %>