MOOC/app/controllers/comments_controller.rb

SELECT  `lectures`.* FROM `lectures` WHERE `lectures`.`id` = 3 LIMIT 1
INSERT INTO `comments` (`body`, `lecture_id`, `created_at`, `updated_at`) VALUES ('new comment', 3, '2018-05-20 15:41:20', '2018-05-20 15:41:20')
---
      def create
        @lecture = Lecture.find(params[:lecture_id])
         @comment = @lecture.comments.create(params[:comment].permit(:body))