MOOC/app/controllers/lectures_controller.rb

def upvote
  @link = Lecture.find(params[:id])
---
SELECT  `lectures`.* FROM `lectures` WHERE `lectures`.`id` = 3 LIMIT 1

def downvote
  @link = Lecture.find(params[:id])
---
SELECT  `lectures`.* FROM `lectures` WHERE `lectures`.`id` = 3 LIMIT 1